src/jbiServiceUnits/AlmaTWE/clientTransWrapper.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="clientTransWrapper" targetNamespace="http://j2ee.netbeans.org/wsdl/AlmaTWE/clientTransWrapper"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/AlmaTWE/clientTransWrapper" xmlns:ns="http://xml.netbeans.org/schema/eventServiceExchange" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/AlmaTWE/clientTransWrapper">
            <xsd:import namespace="http://xml.netbeans.org/schema/eventServiceExchange" schemaLocation="clientTransaction.xsd"/>
        </xsd:schema>
    </types>
    <message name="clientTransWrapperOperationRequest">
        <part name="eventLookupRequest" element="ns:lookupRequest"/>
    </message>
    <message name="clientTransWrapperOperationResponse">
        <part name="eventLookupResponse" element="ns:lookupResponse"/>
    </message>
    <portType name="clientTransWrapperPortType">
        <operation name="clientTransWrapperOperation">
            <input name="input1" message="tns:clientTransWrapperOperationRequest"/>
            <output name="output1" message="tns:clientTransWrapperOperationResponse"/>
        </operation>
    </portType>
    <binding name="ALMATWEBinding" type="tns:clientTransWrapperPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="clientTransWrapperOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="ALMATWEService">
        <port name="ALMATWEPort" binding="tns:ALMATWEBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/ALMATWEService/ALMATWEPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="clientTransWrapper">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="clientTransWrapperPortTypeRole" portType="tns:clientTransWrapperPortType"/>
    </plnk:partnerLinkType>
</definitions>

