test/LookupEventsTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://xml.netbeans.org/schema/eventServiceExchange">
  <soapenv:Body>
    <even:lookupRequest>
      <even:city>NANTES</even:city>
      <even:date>2010-11-12</even:date>
    </even:lookupRequest>
  </soapenv:Body>
</soapenv:Envelope>